zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70064.PIC
      <edc:SFRDef edc:_addr="0x40038244" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038248" edc:offset="0x1B8"/>
      <edc:SFRDef edc:_addr="0x40038400" edc:access="------------------nn-nnn--------" edc:cname="USBHS_HSTCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SOFE" edc:desc="Start of Frame Generation Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="Send USB Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESUME" edc:desc="Send USB Resume" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:desc="Mode Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="Forced high speed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FORCED_FS" edc:desc="The host remains in Full-speed mode whatever the peripheral speed capability." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038404" edc:access="rrrrrrr-------rrrrrrrrrr-rrrrrrr" edc:cname="USBHS_HSTISR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNI" edc:desc="Device Connection Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCI" edc:desc="Device Disconnection Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTI" edc:desc="USB Reset Sent Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDI" edc:desc="Downstream Resume Sent Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMI" edc:desc="Upstream Resume Received Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFI" edc:desc="Host Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPI" edc:desc="Host Wake-Up Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038408" edc:access="-------------------------wwwwwww" edc:cname="USBHS_HSTICR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIC" edc:desc="Device Connection Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIC" edc:desc="Device Disconnection Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIC" edc:desc="USB Reset Sent Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIC" edc:desc="Downstream Resume Sent Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIC" edc:desc="Upstream Resume Received Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIC" edc:desc="Host Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIC" edc:desc="Host Wake-Up Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003840C" edc:access="wwwwwww------------------wwwwwww" edc:cname="USBHS_HSTIFR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIS" edc:desc="Device Connection Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIS" edc:desc="Device Disconnection Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIS" edc:desc="USB Reset Sent Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIS" edc:desc="Downstream Resume Sent Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIS" edc:desc="Upstream Resume Received Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIS" edc:desc="Host Start of Frame Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIS" edc:desc="Host Wake-Up Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
