zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ2038CA70064.PIC
      <edc:SFRDef edc:_addr="0x40038410" edc:access="rrrrrrr-------rrrrrrrrrr-rrrrrrr" edc:cname="USBHS_HSTIMR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIE" edc:desc="Device Connection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIE" edc:desc="Device Disconnection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIE" edc:desc="USB Reset Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIE" edc:desc="Downstream Resume Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIE" edc:desc="Upstream Resume Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIE" edc:desc="Host Start of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIE" edc:desc="Host Wake-Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038414" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIDR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIEC" edc:desc="Device Connection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIEC" edc:desc="Device Disconnection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIEC" edc:desc="USB Reset Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIEC" edc:desc="Downstream Resume Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIEC" edc:desc="Upstream Resume Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIEC" edc:desc="Host Start of Frame Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIEC" edc:desc="Host Wake-Up Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038418" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIER" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIES" edc:desc="Device Connection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIES" edc:desc="Device Disconnection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIES" edc:desc="USB Reset Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIES" edc:desc="Downstream Resume Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIES" edc:desc="Upstream Resume Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIES" edc:desc="Host Start of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIES" edc:desc="Host Wake-Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003841C" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:cname="USBHS_HSTPIP" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PEN0" edc:desc="Pipe 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN1" edc:desc="Pipe 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN2" edc:desc="Pipe 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN3" edc:desc="Pipe 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN4" edc:desc="Pipe 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN5" edc:desc="Pipe 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN6" edc:desc="Pipe 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN7" edc:desc="Pipe 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN8" edc:desc="Pipe 8 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PRST0" edc:desc="Pipe 0 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST1" edc:desc="Pipe 1 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST2" edc:desc="Pipe 2 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST3" edc:desc="Pipe 3 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST4" edc:desc="Pipe 4 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST5" edc:desc="Pipe 5 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST6" edc:desc="Pipe 6 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST7" edc:desc="Pipe 7 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST8" edc:desc="Pipe 8 Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038420" edc:access="--------nnnnnnnn--nnnnnnnnnnnnnn" edc:cname="USBHS_HSTFNUM" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:desc="Micro Frame Number" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLENHIGH" edc:desc="Frame Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038424" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="USBHS_HSTADDR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HSTADDRP0" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP1" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP2" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP3" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
